---
kind: property
id: P:Autodesk.Revit.DB.Visual.Noise.NoiseType
source: html/61a19711-0c66-1811-178c-ee9aec3b1b25.htm
---
# Autodesk.Revit.DB.Visual.Noise.NoiseType Property

The property labeled "Noise Type" from the "Noise" schema.

## Syntax (C#)
```csharp
public static string NoiseType { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "NoiseType".